tap "buo/cask-upgrade"
tap "carlocab/personal"
tap "hashicorp/tap"
tap "homebrew/command-not-found"
tap "vitorgalvao/tiny-scripts"
brew "ack"
brew "ansible-lint"
brew "ansifilter"
brew "gettext"
brew "pcre2"
brew "python-setuptools"
brew "ruby", args: ["HEAD"]
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "cheat"
brew "colordiff"
brew "coreutils"
brew "corkscrew"
brew "curl", args: ["HEAD"]
brew "diff-so-fancy", args: ["HEAD"]
brew "diffutils"
brew "dos2unix"
brew "node"
brew "eslint", args: ["HEAD"]
brew "exiftool"
brew "eza"
brew "fd"
brew "figlet"
brew "file-formula"
brew "findutils"
brew "libtool"
brew "fontforge"
brew "fortune"
brew "fzf", args: ["HEAD"]
brew "fzy", args: ["HEAD"]
brew "gawk"
brew "gh"
brew "git", args: ["HEAD"]
brew "git-extras"
brew "git-flow"
brew "glances"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "pkgconf"
brew "openjdk"
brew "gradle"
brew "gradle-completion", args: ["HEAD"]
brew "grep"
brew "groovy"
brew "gum", args: ["HEAD"]
brew "gzip"
brew "hadolint"
brew "highlight", args: ["HEAD"]
brew "htop"
brew "ifstat"
brew "imagemagick"
brew "ipcalc"
brew "iproute2mac"
brew "jfrog-cli", args: ["HEAD"]
brew "jq", args: ["HEAD"]
brew "jsonlint"
brew "kubecolor"
brew "kubernetes-cli", args: ["HEAD"]
brew "less"
brew "lsof"
brew "lynx"
brew "macvim", args: ["HEAD"], link: false
brew "maven"
brew "mkdocs"
brew "mongosh"
brew "moreutils"
brew "mtr", args: ["HEAD"]
brew "ncdu"
brew "tree-sitter", args: ["HEAD"]
brew "utf8proc", args: ["HEAD"]
brew "neovim", args: ["HEAD"]
brew "nmap"
brew "node@22"
brew "nushell", args: ["HEAD"]
brew "nvm"
brew "openldap"
brew "pandoc"
brew "pass", args: ["HEAD"]
brew "pass-otp"
brew "pinentry-mac", args: ["HEAD"]
brew "poppler", args: ["HEAD"]
brew "proctools"
brew "pstree"
brew "pv"
brew "pwsafe"
brew "python@3.12"
brew "python-tk@3.12"
brew "python-tk@3.13"
brew "rename", args: ["HEAD"]
brew "ripgrep", args: ["HEAD"]
brew "rlwrap", args: ["HEAD"]
brew "sevenzip", args: ["HEAD"]
brew "shellcheck", args: ["HEAD"]
brew "shfmt", args: ["HEAD"]
brew "spark"
brew "stow"
brew "stylelint"
brew "telnet"
brew "the_silver_searcher", args: ["HEAD"]
brew "tig", args: ["HEAD"]
brew "tlrc", args: ["HEAD"]
brew "tmux"
brew "toilet", args: ["HEAD"]
brew "trash", link: true
brew "unzip"
brew "util-linux"
brew "vint"
brew "vnstat"
brew "w3m", args: ["HEAD"]
brew "watch"
brew "wdiff"
brew "wget"
brew "whois", args: ["HEAD"]
brew "yamlfmt", args: ["HEAD"]
brew "yamllint", args: ["HEAD"]
brew "youtube-dl", args: ["HEAD"]
brew "zenity"
brew "zip"
brew "carlocab/personal/unrar"
brew "hashicorp/tap/vault"
cask "alfred"
cask "baiduinput"
cask "beyond-compare"
cask "bob"
cask "chatbox"
cask "cherry-studio"
cask "cleanmymac"
cask "cursor"
cask "dash"
cask "google-chrome@canary"
cask "istat-menus"
cask "jiggler"
cask "keycastr"
cask "macvim"
cask "moom"
cask "paintbrush"
cask "shottr"
cask "sip"
cask "snipaste"
cask "vimr"
cask "wechat"
vscode "argylewolflabs.vscode-groovy"
vscode "dave-hagedorn.jenkins-runner"
vscode "deerawan.vscode-dash"
vscode "dnicolson.binary-plist"
vscode "eamodio.gitlens"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gitpod.gitpod-desktop"
vscode "gitpod.gitpod-remote-ssh"
vscode "henrytsz.nvim"
vscode "ivory-lab.jenkinsfile-support"
vscode "janjoerke.jenkins-pipeline-linter-connector"
vscode "jdinhlife.gruvbox"
vscode "jfrog.jfrog-vscode-extension"
vscode "jonathanharty.gruvbox-material-icon-theme"
vscode "linhmtran168.mac-ca-vscode"
vscode "maarti.jenkins-doc"
vscode "manuth.markdown-converter"
vscode "marlon407.code-groovy"
vscode "mellowmarshmallow.groovy"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "nicolasvuillamy.vscode-groovy-lint"
vscode "paulvarache.vscode-jenkins"
vscode "sainnhe.gruvbox-material"
vscode "secanis.jenkinsfile-support"
vscode "shan.code-settings-sync"
vscode "tabnine.tabnine-vscode"
vscode "tomsaunders.vscode-workspace-explorer"
vscode "twxs.cmake"
vscode "valiantsin.operatormonodarktheme"
vscode "vscodevim.vim"
vscode "xadillax.viml"
